# ６. pandas入门

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
print(Series().__class__)
print(Series.__doc__)
print(Series.__bases__)
print(Series.__name__)
print(DataFrame.__module__)
print(Series.__dict__)

<class 'pandas.core.series.Series'>

    One-dimensional ndarray with axis labels (including time series).

    Labels need not be unique but must be a hashable type. The object
    supports both integer- and label-based indexing and provides a host of
    methods for performing operations involving the index. Statistical
    methods from ndarray have been overridden to automatically exclude
    missing data (currently represented as NaN).

    Operations between Series (+, -, /, *, **) align values based on their
    associated index values-- they need not be the same length. The result
    index will be the sorted union of the two indexes.

    Parameters
    ----------
    data : array-like, dict, or scalar value
        Contains data stored in Series
    index : array-like or Index (1d)
        Values must be hashable and have the same length as `data`.
        Non-unique index values are allowed. Will default to
        RangeIndex(len(data)) if not provided. If both a dict and index
        sequence are used, the index will override the keys found in the
        dict.
    dtype : numpy.dtype or None
        If None, dtype will be inferred
    copy : boolean, default False
        Copy input data

(<class 'pandas.core.base.IndexOpsMixin'>, <class 'pandas.core.strings.StringAccessorMixin'>, <class 'pandas.core.generic.NDFrame'>)
Series
pandas.core.frame
{'all': <function Series.all at 0x7f48bde8bea0>, 'ge': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70ea60>, '_info_axis_number': 0, 'to_period': <function Series.to_period at 0x7f48bde8bbf8>, 'idxmin': <function Series.idxmin at 0x7f48bde8a048>, 'cummin': <function Series.cummin at 0x7f48bde8f2f0>, '_set_values': <function Series._set_values at 0x7f48bde89400>, 'mul': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710ea0>, 'from_csv': <classmethod object at 0x7f48bde85940>, '__rand__': <function _bool_method_SERIES.<locals>.wrapper at 0x7f48bd7190d0>, '_unpickle_series_compat': <function Series._unpickle_series_compat at 0x7f48bde86c80>, 'apply': <function Series.apply at 0x7f48bde8af28>, 'kurt': <function Series.kurt at 0x7f48bde8f840>, 'rmul': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e1e0>, '_reduce': <function Series._reduce at 0x7f48bde8b048>, 'take': <function Series.take at 0x7f48bde8b598>, 'last_valid_index': <function Series.last_valid_index at 0x7f48bde8bae8>, 'truediv': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710f28>, 'radd': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710d90>, 'between': <function Series.between at 0x7f48bde8b6a8>, 'isin': <function Series.isin at 0x7f48bde8b620>, 'append': <function Series.append at 0x7f48bde8a510>, 'argsort': <function Series.argsort at 0x7f48bde8a9d8>, '__rtruediv__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714e18>, '__divmod__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd719598>, '__floordiv__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714510>, '__float__': <function _coerce_method.<locals>.wrapper at 0x7f48bde86ae8>, '__array__': <function Series.__array__ at 0x7f48bde86730>, 'axes': <property object at 0x7f48bde87098>, 'ravel': <function Series.ravel at 0x7f48bde86400>, 'cov': <function Series.cov at 0x7f48bde8a2f0>, '__pow__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714840>, '__getitem__': <function Series.__getitem__ at 0x7f48bde86f28>, 'cumsum': <function Series.cumsum at 0x7f48bde8f400>, 'repeat': <function Series.repeat at 0x7f48bde89598>, 'mod': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e0d0>, '__rfloordiv__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd7170d0>, '__array_prepare__': <function Series.__array_prepare__ at 0x7f48bde86840>, 'cummax': <function Series.cummax at 0x7f48bde8f620>, 'compress': <function Series.compress at 0x7f48bde86488>, '__and__': <function _bool_method_SERIES.<locals>.wrapper at 0x7f48bd717c80>, 'searchsorted': <function Series.searchsorted at 0x7f48bde8a620>, 'set_value': <function Series.set_value at 0x7f48bde896a8>, 'mad': <function NDFrame._add_numeric_operations.<locals>.mad at 0x7f48bde8bf28>, 'rpow': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e620>, 'to_dict': <function Series.to_dict at 0x7f48bde89ae8>, 'argmin': <function Series.idxmin at 0x7f48bde8a048>, '_set_name': <function Series._set_name at 0x7f48bde89c80>, '__xor__': <function _bool_method_SERIES.<locals>.wrapper at 0x7f48bd717ea0>, 'to_frame': <function Series.to_frame at 0x7f48bde89b70>, '_AXIS_NAMES': {0: 'index'}, '__rxor__': <function _bool_method_SERIES.<locals>.wrapper at 0x7f48bd719400>, 'name': <property object at 0x7f48bde80e08>, '_dir_deletions': <function Series._dir_deletions at 0x7f48bde8bd90>, '__ge__': <function _comp_method_SERIES.<locals>.wrapper at 0x7f48bd717b70>, 'sort_values': <function Series.sort_values at 0x7f48bde8a8c8>, 'plot': <pandas.core.base.AccessorProperty object at 0x7f48bde85ac8>, '_metadata': ['name'], '__or__': <function _bool_method_SERIES.<locals>.wrapper at 0x7f48bd717d90>, '__mul__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd7141e0>, 'eq': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e7b8>, 'nlargest': <function Series.nlargest at 0x7f48bde8aa60>, '_binop': <function Series._binop at 0x7f48bde8a6a8>, 'cumprod': <function Series.cumprod at 0x7f48bde8f510>, '__ipow__': <function add_special_arithmetic_methods.<locals>._wrap_inplace_method.<locals>.f at 0x7f48bd7197b8>, '__long__': <function _coerce_method.<locals>.wrapper at 0x7f48bde86b70>, 'div': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710f28>, 'kurtosis': <function Series.kurt at 0x7f48bde8f840>, '__setitem__': <function Series.__setitem__ at 0x7f48bde891e0>, 'transform': <function NDFrame._add_series_or_dataframe_operations.<locals>.transform at 0x7f48bde3ae18>, '_AXIS_NUMBERS': {'index': 0}, 'ftypes': <property object at 0x7f48bde80ef8>, 'items': <function Series.iteritems at 0x7f48bde89950>, 'skew': <function Series.skew at 0x7f48bde8f7b8>, 'reorder_levels': <function Series.reorder_levels at 0x7f48bde8ac80>, '_stat_axis_number': 0, 'any': <function Series.any at 0x7f48bde6d400>, 'to_timestamp': <function Series.to_timestamp at 0x7f48bde8bb70>, 'compound': <function NDFrame._add_numeric_operations.<locals>.compound at 0x7f48bde8f1e0>, '__rdiv__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714e18>, '__le__': <function _comp_method_SERIES.<locals>.wrapper at 0x7f48bd717a60>, 'var': <function Series.var at 0x7f48bde8f0d0>, '__unicode__': <function Series.__unicode__ at 0x7f48bde897b8>, '__array_wrap__': <function Series.__array_wrap__ at 0x7f48bde867b8>, 'expanding': <function NDFrame._add_series_or_dataframe_operations.<locals>.expanding at 0x7f48bde3ad08>, '__add__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd70ebf8>, '__iter__': <function Series.__iter__ at 0x7f48bde898c8>, 'dtypes': <property object at 0x7f48bde80e58>, 'dtype': <property object at 0x7f48bde80db8>, 'reset_index': <function Series.reset_index at 0x7f48bde89730>, 'real': <property object at 0x7f48bde870e8>, '__module__': 'pandas.core.series', '_values': <property object at 0x7f48bde80f98>, 'mean': <function Series.mean at 0x7f48bde8f730>, 'drop_duplicates': <function Series.drop_duplicates at 0x7f48bde89ea0>, 'put': <function Series.put at 0x7f48bde86598>, '_make_cat_accessor': <function Series._make_cat_accessor at 0x7f48bde8bd08>, 'min': <function Series.min at 0x7f48bde8fa60>, 'get_values': <function Series.get_values at 0x7f48bde862f0>, 'gt': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e950>, 'add': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd7100d0>, 'argmax': <function Series.idxmax at 0x7f48bde8a0d0>, '__sub__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714048>, 'idxmax': <function Series.idxmax at 0x7f48bde8a0d0>, '_AXIS_REVERSED': False, 'rename': <function Series.rename at 0x7f48bde8b268>, 'quantile': <function Series.quantile at 0x7f48bde8a1e0>, 'product': <function Series.prod at 0x7f48bde8f8c8>, 'std': <function Series.std at 0x7f48bde8f158>, 'rolling': <function NDFrame._add_series_or_dataframe_operations.<locals>.rolling at 0x7f48bde8fbf8>, '_dir_additions': <function Series._dir_additions at 0x7f48bde8be18>, '__int__': <function _coerce_method.<locals>.wrapper at 0x7f48bde86bf8>, 'max': <function Series.max at 0x7f48bde8f9d8>, '_set_axis': <function Series._set_axis at 0x7f48bde84c80>, '_slice': <function Series._slice at 0x7f48bde86ea0>, 'nsmallest': <function Series.nsmallest at 0x7f48bde8aae8>, 'rdiv': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e400>, 'index': <pandas._libs.lib.AxisProperty object at 0x7f48bf895528>, '__rmod__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd717510>, '_agg_doc': "\nExamples\n--------\n\n>>> s = Series(np.random.randn(10))\n\n>>> s.agg('min')\n-1.3018049988556679\n\n>>> s.agg(['min', 'max'])\nmin   -1.301805\nmax    1.127688\ndtype: float64\n\nSee also\n--------\npandas.Series.apply\npandas.Series.transform\n\n", 'dt': <pandas.core.base.AccessorProperty object at 0x7f48bde85978>, 'autocorr': <function Series.autocorr at 0x7f48bde8a400>, 'sem': <function Series.sem at 0x7f48bde8f048>, '_ixs': <function Series._ixs at 0x7f48bde86d90>, 'view': <function Series.view at 0x7f48bde866a8>, '_gotitem': <function Series._gotitem at 0x7f48bde8ae18>, '_index': None, 'rsub': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e2f0>, 'sub': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710e18>, '_info_axis_name': 'index', '_get_with': <function Series._get_with at 0x7f48bde89048>, '_can_hold_na': <property object at 0x7f48bde80d68>, 'tolist': <function Series.tolist at 0x7f48bde89a60>, '_needs_reindex_multi': <function Series._needs_reindex_multi at 0x7f48bde8b158>, 'diff': <function Series.diff at 0x7f48bde8a378>, 'valid': <function Series.<lambda> at 0x7f48bde8b9d8>, 'to_string': <function Series.to_string at 0x7f48bde89840>, 'sort_index': <function Series.sort_index at 0x7f48bde8a950>, '_AXIS_LEN': 1, 'shift': <function Series.shift at 0x7f48bde8b400>, 'ftype': <property object at 0x7f48bde80ea8>, '_is_mixed_type': <property object at 0x7f48bde87188>, 'agg': <function Series.aggregate at 0x7f48bde8aea0>, 'values': <property object at 0x7f48bde80f48>, 'reshape': <function Series.reshape at 0x7f48bde89488>, '__isub__': <function add_special_arithmetic_methods.<locals>._wrap_inplace_method.<locals>.f at 0x7f48bd719620>, 'lt': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e8c8>, 'prod': <function Series.prod at 0x7f48bde8f8c8>, 'aggregate': <function Series.aggregate at 0x7f48bde8aea0>, '__itruediv__': <function add_special_arithmetic_methods.<locals>._wrap_inplace_method.<locals>.f at 0x7f48bd719730>, 'unique': <function Series.unique at 0x7f48bde89e18>, 'align': <function Series.align at 0x7f48bde8b1e0>, 'mode': <function Series.mode at 0x7f48bde89d90>, 'round': <function Series.round at 0x7f48bde8a158>, 'dropna': <function Series.dropna at 0x7f48bde8b950>, '__radd__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd70ee18>, '_stat_axis_name': 'index', '__ror__': <function _bool_method_SERIES.<locals>.wrapper at 0x7f48bd719268>, 'floordiv': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e048>, 'combine': <function Series.combine at 0x7f48bde8a730>, '_typ': 'series', 'median': <function Series.median at 0x7f48bde8f950>, 'to_sparse': <function Series.to_sparse at 0x7f48bde89bf8>, 'to_excel': <function Series.to_excel at 0x7f48bde8b8c8>, '_make_dt_accessor': <function Series._make_dt_accessor at 0x7f48bde8bc80>, 'imag': <property object at 0x7f48bde87138>, 'ptp': <function Series.ptp at 0x7f48bde8fb70>, 'memory_usage': <function Series.memory_usage at 0x7f48bde8b510>, 'get_value': <function Series.get_value at 0x7f48bde89620>, 'nonzero': <function Series.nonzero at 0x7f48bde86510>, '_accessors': frozenset({'dt', 'str', 'cat'}), 'multiply': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710ea0>, 'le': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e9d8>, 'reindex': <function Series.reindex at 0x7f48bde8b2f0>, '_constructor_expanddim': <property object at 0x7f48bde80d18>, '__truediv__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714378>, 'from_array': <classmethod object at 0x7f48bde7a208>, '_set_labels': <function Series._set_labels at 0x7f48bde89378>, '__rsub__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714bf8>, '_AXIS_IALIASES': {0: 'rows'}, '_ix': None, '_get_values': <function Series._get_values at 0x7f48bde89158>, '_allow_index_ops': True, 'duplicated': <function Series.duplicated at 0x7f48bde89f28>, 'pow': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e158>, '_set_with': <function Series._set_with at 0x7f48bde892f0>, '__len__': <function Series.__len__ at 0x7f48bde86620>, 'iteritems': <function Series.iteritems at 0x7f48bde89950>, '__imul__': <function add_special_arithmetic_methods.<locals>._wrap_inplace_method.<locals>.f at 0x7f48bd7196a8>, 'ne': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e840>, '__rpow__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd7172f0>, '_constructor': <property object at 0x7f48bde75778>, 'dot': <function Series.dot at 0x7f48bde8a488>, '_reindex_indexer': <function Series._reindex_indexer at 0x7f48bde8b0d0>, '_set_subtyp': <function Series._set_subtyp at 0x7f48bde84d08>, '__eq__': <function _comp_method_SERIES.<locals>.wrapper at 0x7f48bd717620>, 'fillna': <function Series.fillna at 0x7f48bde8b378>, '__mod__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd7146a8>, 'rfloordiv': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e510>, '__gt__': <function _comp_method_SERIES.<locals>.wrapper at 0x7f48bd717950>, '__init__': <function Series.__init__ at 0x7f48bde82b70>, '_AXIS_ORDERS': ['index'], 'map': <function Series.map at 0x7f48bde8ad90>, '__rmul__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd7149d8>, '_set_with_engine': <function Series._set_with_engine at 0x7f48bde89268>, 'keys': <function Series.keys at 0x7f48bde899d8>, '_get_values_tuple': <function Series._get_values_tuple at 0x7f48bde890d0>, 'asobject': <property object at 0x7f48bde87048>, 'cat': <pandas.core.base.AccessorProperty object at 0x7f48bde85a20>, '__ne__': <function _comp_method_SERIES.<locals>.wrapper at 0x7f48bd717730>, 'sortlevel': <function Series.sortlevel at 0x7f48bde8ab70>, '__div__': <function _arith_method_SERIES.<locals>.wrapper at 0x7f48bd714378>, 'count': <function Series.count at 0x7f48bde89d08>, 'corr': <function Series.corr at 0x7f48bde8a268>, 'swaplevel': <function Series.swaplevel at 0x7f48bde8abf8>, 'rtruediv': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e400>, 'unstack': <function Series.unstack at 0x7f48bde8ad08>, '_AXIS_SLICEMAP': None, '__doc__': '\n    One-dimensional ndarray with axis labels (including time series).\n\n    Labels need not be unique but must be a hashable type. The object\n    supports both integer- and label-based indexing and provides a host of\n    methods for performing operations involving the index. Statistical\n    methods from ndarray have been overridden to automatically exclude\n    missing data (currently represented as NaN).\n\n    Operations between Series (+, -, /, *, **) align values based on their\n    associated index values-- they need not be the same length. The result\n    index will be the sorted union of the two indexes.\n\n    Parameters\n    ----------\n    data : array-like, dict, or scalar value\n        Contains data stored in Series\n    index : array-like or Index (1d)\n        Values must be hashable and have the same length as `data`.\n        Non-unique index values are allowed. Will default to\n        RangeIndex(len(data)) if not provided. If both a dict and index\n        sequence are used, the index will override the keys found in the\n        dict.\n    dtype : numpy.dtype or None\n        If None, dtype will be inferred\n    copy : boolean, default False\n        Copy input data\n    ', 'to_csv': <function Series.to_csv at 0x7f48bde8b7b8>, 'hist': <function hist_series at 0x7f48bd70fd90>, 'reindex_axis': <function Series.reindex_axis at 0x7f48bde8b488>, '_update_inplace': <function Series._update_inplace at 0x7f48bde84d90>, '__iadd__': <function add_special_arithmetic_methods.<locals>._wrap_inplace_method.<locals>.f at 0x7f48bde3b158>, 'combine_first': <function Series.combine_first at 0x7f48bde8a7b8>, 'update': <function Series.update at 0x7f48bde8a840>, 'divide': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710f28>, '__lt__': <function _comp_method_SERIES.<locals>.wrapper at 0x7f48bd717840>, 'first_valid_index': <function Series.first_valid_index at 0x7f48bde8ba60>, 'sum': <function Series.sum at 0x7f48bde8f6a8>, 'subtract': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd710e18>, 'ewm': <function NDFrame._add_series_or_dataframe_operations.<locals>.ewm at 0x7f48bde3ad90>, '_AXIS_ALIASES': {'rows': 0}, 'rmod': <function _flex_method_SERIES.<locals>.flex_wrapper at 0x7f48bd70e730>}

In [13]:
type(Series())

pandas.core.series.Series

## 6.1 Series

- ### list to Series

In [20]:
obj = pd.Series([4,-7,8,9])
obj

0    4
1   -7
2    8
3    9
dtype: int64

In [21]:
obj.values

array([ 4, -7,  8,  9])

In [22]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
obj2=Series([4,5,0,-4],index=['d','a','b','fg'])
obj2

d     4
a     5
b     0
fg   -4
dtype: int64

In [26]:
obj2['a']

5

In [27]:
obj2[obj2>0]

d    4
a    5
dtype: int64

In [29]:
'a' in obj2

True

In [30]:
'c' in obj2

False

- ### dict to Series

In [32]:
sd = {"Ohio":3500,"Texas":7100,"Oregon":1600,"Utah":5100}
obj3=Series(sd)
obj3

Ohio      3500
Oregon    1600
Texas     7100
Utah      5100
dtype: int64

In [33]:
states={"California","Ohio","New York"}
obj4=Series(sd,index=states)
obj4

Ohio          3500.0
New York         NaN
California       NaN
dtype: float64

In [36]:
pd.isnull(obj4)

Ohio          False
New York       True
California     True
dtype: bool

In [38]:
pd.notnull(obj4)

Ohio           True
New York      False
California    False
dtype: bool

In [39]:
obj3+obj4

California       NaN
New York         NaN
Ohio          7000.0
Oregon           NaN
Texas            NaN
Utah             NaN
dtype: float64

In [40]:
(obj3+obj4).index

Index(['California', 'New York', 'Ohio', 'Oregon', 'Texas', 'Utah'], dtype='object')

## 6.2 DataFrame

- ### dict to DataFrame

In [101]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002],'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [102]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [103]:
frame2=DataFrame(data,columns=['state','pop','year'])
frame2

    state  pop  year
0    Ohio  1.5  2000
1    Ohio  1.7  2001
2    Ohio  3.6  2002
3  Nevada  2.4  2001
4  Nevada  2.9  2002

In [104]:
frame3=DataFrame(data,index=['one','two','three','four','five'])
frame3

       pop   state  year
one    1.5    Ohio  2000
two    1.7    Ohio  2001
three  3.6    Ohio  2002
four   2.4  Nevada  2001
five   2.9  Nevada  2002

In [119]:
frame3.columns

Index(['pop', 'state', 'year', 'debt'], dtype='object')

In [120]:
frame3.values

array([[1.5, 'Ohio', 2000, 0],
       [1.7, 'Ohio', 2001, 1],
       [3.6, 'Ohio', 2002, 2],
       [2.4, 'Nevada', 2001, 3],
       [2.9, 'Nevada', 2002, 4]], dtype=object)

In [106]:
frame3['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [107]:
frame3.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [108]:
frame3['debt']=12
frame3

       pop   state  year  debt
one    1.5    Ohio  2000    12
two    1.7    Ohio  2001    12
three  3.6    Ohio  2002    12
four   2.4  Nevada  2001    12
five   2.9  Nevada  2002    12

In [109]:
frame3['debt']=range(5)
frame3

       pop   state  year  debt
one    1.5    Ohio  2000     0
two    1.7    Ohio  2001     1
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3
five   2.9  Nevada  2002     4

In [117]:
frame3.ix[3]

pop         2.4
state    Nevada
year       2001
debt          3
Name: four, dtype: object

In [111]:
frame3.ix['four']

pop         2.4
state    Nevada
year       2001
debt          3
Name: four, dtype: object

In [112]:
frame3['eastern']=frame3.state=='Ohio'
frame3

       pop   state  year  debt  eastern
one    1.5    Ohio  2000     0     True
two    1.7    Ohio  2001     1     True
three  3.6    Ohio  2002     2     True
four   2.4  Nevada  2001     3    False
five   2.9  Nevada  2002     4    False

In [114]:
frame3.columns
del frame3['eastern']

In [115]:
frame3

       pop   state  year  debt
one    1.5    Ohio  2000     0
two    1.7    Ohio  2001     1
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3
five   2.9  Nevada  2002     4

In [116]:
frame3.T

        one   two three    four    five
pop     1.5   1.7   3.6     2.4     2.9
state  Ohio  Ohio  Ohio  Nevada  Nevada
year   2000  2001  2002    2001    2002
debt      0     1     2       3       4

- ### index对象

In [161]:
ind = frame3.index
ind

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [162]:
ind[:3]

Index(['one', 'two', 'three'], dtype='object')

In [163]:
#index是immutable对象,　不可以修改已经有的值
ind[3]='三'

TypeError: Index does not support mutable operations

In [164]:
frame3.reindex(['two','three','four','one','five','six','seven'])

       pop   state    year  debt
two    1.7    Ohio  2001.0   1.0
three  3.6    Ohio  2002.0   2.0
four   2.4  Nevada  2001.0   3.0
one    1.5    Ohio  2000.0   0.0
five   2.9  Nevada  2002.0   4.0
six    NaN     NaN     NaN   NaN
seven  NaN     NaN     NaN   NaN

In [165]:
frame3.reindex(['two','three','four','one','five','six','seven'],fill_value=100)

         pop   state  year  debt
two      1.7    Ohio  2001     1
three    3.6    Ohio  2002     2
four     2.4  Nevada  2001     3
one      1.5    Ohio  2000     0
five     2.9  Nevada  2002     4
six    100.0     100   100   100
seven  100.0     100   100   100

In [166]:
frame３

       pop   state  year  debt
one    1.5    Ohio  2000     0
two    1.7    Ohio  2001     1
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3
five   2.9  Nevada  2002     4

In [167]:
# frame3.drop(['six'])

In [168]:
frame3

       pop   state  year  debt
one    1.5    Ohio  2000     0
two    1.7    Ohio  2001     1
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3
five   2.9  Nevada  2002     4

In [169]:
frame3[frame3['pop']>2]

       pop   state  year  debt
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3
five   2.9  Nevada  2002     4

In [170]:
frame3[1:4]

       pop   state  year  debt
two    1.7    Ohio  2001     1
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3

In [171]:
frame3['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [172]:
frame3<10

        pop  state   year  debt
one    True   True  False  True
two    True   True  False  True
three  True   True  False  True
four   True   True  False  True
five   True   True  False  True

In [174]:
frame3

       pop   state  year  debt
one    1.5    Ohio  2000     0
two    1.7    Ohio  2001     1
three  3.6    Ohio  2002     2
four   2.4  Nevada  2001     3
five   2.9  Nevada  2002     4

In [177]:
frame3.ix[['Ohio'],[1,2,3]]

     state  year  debt
Ohio   NaN   NaN   NaN

## 算术运算和数据对齐

In [3]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','f','e','g'])
s1+s2

a    5.2
c    1.1
d    NaN
e    5.5
f    NaN
g    NaN
dtype: float64

In [10]:
d1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
d2 = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Ohio','Texas','Utah','Oregon'])
d1+d2

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio      0.0 NaN  3.0 NaN
Oregon    NaN NaN  NaN NaN
Texas     6.0 NaN  9.0 NaN
Utah      NaN NaN  NaN NaN

In [11]:
d1.add(d2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      0.0  1.0   3.0   2.0
Oregon    9.0  NaN  10.0  11.0
Texas     6.0  4.0   9.0   5.0
Utah      6.0  NaN   7.0   8.0

In [12]:
d2.add(d1,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      0.0  1.0   3.0   2.0
Oregon    9.0  NaN  10.0  11.0
Texas     6.0  4.0   9.0   5.0
Utah      6.0  NaN   7.0   8.0

In [18]:
# d1.reindex(index=['Ohio','Texas','Utah','Oregon'])
d1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

d2

### 函数应用和映射

In [22]:
f = DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
f

               b         d         e
Utah   -0.206276 -1.151213  0.960068
Ohio    0.454822 -0.230140 -1.108620
Texas   1.405977 -0.619003  0.352228
Oregon -1.269022 -0.511869 -0.106956

In [25]:
foo = lambda x:x.max()-x.min()
f.apply(foo)

b    2.674999
d    0.921073
e    2.068688
dtype: float64

In [26]:
f.apply(foo,axis=1)

Utah      2.111281
Ohio      1.563442
Texas     2.024981
Oregon    1.162066
dtype: float64

In [27]:
def fun(x):
    return Series([x.min(),x.max()],index=['min','max'])
f.apply(fun)

            b         d         e
min -1.269022 -1.151213 -1.108620
max  1.405977 -0.230140  0.960068

### 排序和排名

In [35]:
obj = Series(range(4),index=['d','c','a','b'])
obj

AttributeError: 'Series' object has no attribute 'order'

In [29]:
obj.sort_index()

a    2
b    3
c    1
d    0
dtype: int64

### 注意排名rank和排序的不同

#### 不区分数值出现的顺序

In [43]:
obj = Series([7.-5,7,4,2,0,4])
obj.rank()

0    2.5
1    6.0
2    4.5
3    2.5
4    1.0
5    4.5
dtype: float64

#### 区分数值出现的先后顺序

In [44]:
obj.rank(method='first')

0    2.0
1    6.0
2    4.0
3    3.0
4    1.0
5    5.0
dtype: float64

In [46]:
frm = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frm

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [51]:
print(frm.rank())
frm.rank(axis=0)

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [48]:
frm.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### 带有重复值的索引

In [52]:
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])
df

          0         1         2
a -1.316786 -0.083821  1.605374
a  1.211833 -0.865484  0.231857
b -1.129528 -1.109946  1.532517
b  0.492220  1.245905 -1.536293

In [54]:
df.ix['b']

          0         1         2
b -1.129528 -1.109946  1.532517
b  0.492220  1.245905 -1.536293

In [55]:
df.index.is_unique

False

### 汇总计算和描述统计

In [58]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [59]:
df.sum()

one    9.25
two   -5.80
dtype: float64

#### axis : 操作轴，DataFrame的行用0, 列用1

In [65]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [66]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### 处理缺失数据

#### *np.nan和python内置的None都会被当做NA来处理*

In [68]:
data = Series(["lakers","clippers","spurs",np.nan,"rockets",None])
data

0      lakers
1    clippers
2       spurs
3         NaN
4     rockets
5        None
dtype: object

In [69]:
data.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [70]:
data.notnull()

0     True
1     True
2     True
3    False
4     True
5    False
dtype: bool

#### 滤除缺失的数据

In [71]:
data.dropna()

0      lakers
1    clippers
2       spurs
4     rockets
dtype: object

In [72]:
data[data.notnull()]

0      lakers
1    clippers
2       spurs
4     rockets
dtype: object

In [73]:
frm = DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])
frm

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [77]:
frm.dropna()

     0    1    2
0  1.0  6.5  3.0

In [78]:
frm.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [79]:
frm.dropna(axis=0,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

### 填充缺失的数据

In [80]:
frm.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

### 针对不同的列进行填充不同的值

In [85]:
frm.fillna({1:100,2:-1})

     0      1    2
0  1.0    6.5  3.0
1  1.0  100.0 -1.0
2  NaN  100.0 -1.0
3  NaN    6.5  3.0

### 层次化索引

In [87]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,1,2]])
data

a  1   -0.355396
   2   -0.835153
   3   -1.382004
b  1   -0.253211
   2    0.450039
   3   -0.333865
c  1    1.003190
   2   -0.297199
d  1   -0.693626
   2   -1.191112
dtype: float64

In [88]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 0, 1]])

In [89]:
data['a']

1   -0.355396
2   -0.835153
3   -1.382004
dtype: float64

In [90]:
data['b':'c']

b  1   -0.253211
   2    0.450039
   3   -0.333865
c  1    1.003190
   2   -0.297199
dtype: float64

In [91]:
data[:,2]

a   -0.835153
b    0.450039
c   -0.297199
d   -1.191112
dtype: float64

In [92]:
data.unstack()

          1         2         3
a -0.355396 -0.835153 -1.382004
b -0.253211  0.450039 -0.333865
c  1.003190 -0.297199       NaN
d -0.693626 -1.191112       NaN

In [95]:
data.unstack().stack()

a  1   -0.355396
   2   -0.835153
   3   -1.382004
b  1   -0.253211
   2    0.450039
   3   -0.333865
c  1    1.003190
   2   -0.297199
d  1   -0.693626
   2   -1.191112
dtype: float64

In [103]:
frm = DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frm

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [106]:
frm.index.names=['key1','key2']
frm.columns.names=['state','color']

In [107]:
frm

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [108]:
frm.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11